config/Enums/МетодыОкругления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>МетодыОкругления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Математически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отбрасывать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/Enums/СпособыОкруглений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СпособыОкруглений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>До10коп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>До50коп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоРуб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>До5Руб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>До10Руб</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/CommonModules/ОМ3_РасчетныеФункции/Ext/Module.bsl
//============================================================================ GtG ===
Функция ОМ3_ПолучитьНДСПоСуммеСНДСИСтавке  (СуммаСНДС,СтавкаНДС,ОкруглятьДо=2,ДатаСравнения = Неопределено) Экспорт
    // Назначение:
	// Расчитывает сумму НДС по указанной сумме с НДС и ставке
	// Результат округляется до указанного количества знаков (2 по умолчанию)
    // 
	//--------------------------------------------------------------------------------
	
	ДатаСравнения = ?(ДатаСравнения = Неопределено, ТекущаяДата(), ДатаСравнения);
	Если ТипЗнч(СтавкаНДС) = Тип("СправочникСсылка.СтавкиНДС") Тогда
		//Ст=СтавкаНДС.Ставка;
		Ст=ПереопределениеЗначенияСтавки20_18(СтавкаНДС,ДатаСравнения);
	Иначе 	
		Ст=СтавкаНДС;
	КонецЕсли;  	
	
	
    Если (Ст=0) Тогда
	
		Возврат 0; // не бывает суммы НДС у НДС 0%
	
	КонецЕсли; 
 
	 Рез= СуммаСНДС*Ст/(100+Ст);
     Возврат Рез;
КонецФункции
//============================================================================ GtG ===

//============================================================================ GtG ===
Функция ОМ3_ЭтоПустаяДата  (ПРоверяемаяДата) Экспорт
    // Назначение:
	// Проверяет дату на пустую
	//--------------------------------------------------------------------------------
	Если ПроверяемаяДата=Дата("00010101") Тогда
		Возврат ИСТИНА;
	Иначе
		Возврат ЛОЖЬ;
	КонецЕсли; 
КонецФункции
//============================================================================ GtG ===

//==========================================================GtG====
Функция ОМ3_ПустаяДата ()  Экспорт
	//----------------------------------
	//Назначение:
	//  Возвращает дату-начало отсчета
	//  
	//  
	//  
	//----------------------------------
	
	
	
	
	Возврат Дата("00010101");	
	
КонецФункции	//ОМ3_ПустаяДата
//==========================================================Virus====
// <Возвращает дату последнего документа за указанный день + 3 секунды >
Функция ОМ3_ПоследняяДата(ДатаДок,ТипДок="ПеремещениеТовара") Экспорт
	
		ТХТ = "ВЫБРАТЬ
	      |	MAX("+ТипДок+".Дата) как Дата
	      |ИЗ
	      |	Документ."+ТипДок+" КАК "+ТипДок+"
	      |ГДЕ
	      |	"+ТипДок+".Дата < &КонДата И "+ТипДок+".Дата > &НачДата";
		  
		  
		Запрос = Новый Запрос;  
		Запрос.УстановитьПараметр("КонДата",КонецДня(ДатаДок));
		Запрос.УстановитьПараметр("НачДата",НачалоДня(ДатаДок));

		Запрос.Текст=Тхт;
		Рез=Запрос.Выполнить().Выгрузить();
		Если Рез.Количество()=0 Тогда
			Возврат ДатаДок;
		Иначе
			
			
			Если СокрЛП(Рез.Получить(0).Дата)="" ТОгда
				Возврат ДатаДок; //Возврат НачалоДня(ДатаДок)+3;
			Иначе	 
				Возврат (Рез.Получить(0).Дата+3);
			КонецЕсли; 
		КонецЕсли;

КонецФункции // ОМ3_ПоследняяДата(ДатаДок)
 


//==========================================================GtG====
Функция ОМ3_НДСИзСуммыПоСтавке (СуммаСНДС,СтавкаНДС,ОкруглятьДо=2)  Экспорт
	//----------------------------------
	//Назначение:
	//  Выделить НДС из Суммы с ндс по указанной ставке
	//  сумма включает НДС
	//  округлить результат до указанного значения
	//  
	//----------------------------------
	Если ТипЗнч(СтавкаНДС) = Тип("Число") Тогда
		Рез= СтавкаНДС*СуммаСНДС/(100+СтавкаНДС);// без округления
	Иначе
		Рез= СтавкаНДС.Ставка*СуммаСНДС/(100+СтавкаНДС.Ставка);// без округления
	КонецЕсли;
	
	Рез=Окр(Рез,ОкруглятьДо);
	
	Возврат Рез;	
	
КонецФункции	//ОМ3_НДСИзСуммыПоСтавке
//==========================================================GtG====
//==========================================================GtG====
Функция ОМ3_ОтброситьДо10Коп (Сумма)  Экспорт
	//----------------------------------
	//Назначение:
	//  отбрасывает все после 10 коп
	//  
	//  
	//  
	//----------------------------------
	 ЦелЧСуммы=Цел(Сумма);
	 ДесяткиКоп=Цел((Сумма-ЦелЧСуммы)*10); //10.21-10=0,21*10=2,10==2
	
	 Рез= ЦелЧСуммы+ДесяткиКоп/10;
	
	Возврат Рез
	
КонецФункции	//ОМ3_ОтброситьДо10Коп
//==========================================================GtG====


//==========================================================GtG====
Функция ОМ3_СтавкаНДС_ПоЧислу (ЧСтавка)  Экспорт
	//----------------------------------
	//Назначение:
	//  Получить ставку НДС по числу ставки
	//  
	//  
	//  
	//----------------------------------
	
	Рез=Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка",Чставка);
	
	
	
	Возврат Рез;	
	
КонецФункции	//ОМ3_СтавкаНДС_ПоЧислу
//==========================================================GtG====

Функция Округлить(п_Число, СпособОкругления, МетодОкругления) Экспорт
	
	Если МетодОкругления = Перечисления.МетодыОкругления.Отбрасывать Тогда
		п_Отбрасывать = Истина;
	Иначе
		п_Отбрасывать = Ложь;
	КонецЕсли;
	
	Если СпособОкругления = Перечисления.СпособыОкруглений.До10коп Тогда
		п_Способ = 0.1;
	ИначеЕсли СпособОкругления = Перечисления.СпособыОкруглений.До50коп Тогда
		п_Способ = 0.5;
	ИначеЕсли СпособОкругления = Перечисления.СпособыОкруглений.ДоРуб Тогда
		п_Способ = 1;		
	ИначеЕсли СпособОкругления = Перечисления.СпособыОкруглений.До5Руб Тогда
		п_Способ = 5;		
	ИначеЕсли СпособОкругления = Перечисления.СпособыОкруглений.До10Руб Тогда
		п_Способ = 10;		
	КонецЕсли;
	
	Если			п_Способ = 0.1	Тогда
		Если п_Отбрасывать Тогда
			Возврат Цел(п_Число*10)/10;
		Иначе
			Возврат Окр(п_Число,1);
		КонецЕсли;
		
	ИначеЕсли п_Способ = 0.5	Тогда
		Если п_Отбрасывать Тогда
			Если п_Число-Цел(п_Число)<0.5 Тогда
				Возврат Цел(п_Число);
			Иначе
				Возврат Цел(п_Число)+0.5;
			КонецЕсли;
		Иначе
			Если п_Число-Цел(п_Число)<0.3 Тогда
				Возврат Цел(п_Число);
			ИначеЕсли п_Число-Цел(п_Число)<0.8 Тогда
				Возврат Цел(п_Число)+0.5;
			Иначе
				Возврат Цел(п_Число)+1;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли п_Способ = 1 Тогда
		Если п_Отбрасывать Тогда
			Возврат Цел(п_Число);
		Иначе
			Возврат Окр(п_Число,0);
		КонецЕсли;
		
	ИначеЕсли п_Способ = 5 Тогда
		Если п_Отбрасывать Тогда
			Если п_Число/10-Цел(п_Число/10)<0.5 Тогда
				Возврат Цел(п_Число/10)*10;
			Иначе
				Возврат Цел(п_Число/10)*10+5;
			КонецЕсли;
		Иначе
			Если п_Число/10-Цел(п_Число/10)<0.3 Тогда
				Возврат Цел(п_Число/10)*10;
			ИначеЕсли п_Число/10-Цел(п_Число/10)<0.8 Тогда
				Возврат Цел(п_Число/10)*10+5;
			Иначе
				Возврат Цел(п_Число/10)*10+10;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли п_Способ = 10 Тогда
		Если п_Отбрасывать Тогда
			Возврат Цел(п_Число/10)*10;
		Иначе
			Возврат Окр(п_Число,-1);
		КонецЕсли;
	КонецЕсли;
	
	ВызватьИсключение "ОШИБКА! Не удалось определить метод округления.";
	
КонецФункции

#Область СтавкаНДС20_18
//	СтавкаНДС		- тип СтавкаНДС, проверяемая ставка
//	ДатаПроверки	- тип Дата, 
//	Осуществляет проверку переданной ставки НДС на указанную дату и для элемента "20% (18%)" (код 3)
//  возвращает значение ставки 20 или 18 в зависимости от даты
Функция ПереопределениеЗначенияСтавки20_18(СтавкаНДС,ДатаПроверки) Экспорт

	ВозвращаемоеЗначение = СтавкаНДС.Ставка;
	Если СтавкаНДС.Код = 3 Тогда
	
		Если ДатаПроверки < Дата(2019,1,1) Тогда
			ВозвращаемоеЗначение = 18
		КонецЕсли;
	
	КонецЕсли; 
	
	Возврат ВозвращаемоеЗначение;

КонецФункции // ЗначениеСтавки20_18()
	
#КонецОбласти
